combined/BEEGFS-all-k8s-node/fio-k8s-read-unbuffered-block_512k-size_4G-threads_4.log
fio-beegfs-read-unbuffered-block_512k-size_4G-threads_4: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-read-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-read-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-read-unbuffered-block_512k-size_4G-threads_4: (groupid=0, jobs=4): err= 0: pid=12518: Sat Nov 24 03:05:53 2018
  read : io=114846MB, bw=489999KB/s, iops=957, runt=240004msec
    clat (usec): min=1745, max=43259, avg=4177.47, stdev=781.44
     lat (usec): min=1745, max=43259, avg=4177.62, stdev=781.44
    clat percentiles (usec):
     |  1.00th=[ 3344],  5.00th=[ 3888], 10.00th=[ 3920], 20.00th=[ 3952],
     | 30.00th=[ 3952], 40.00th=[ 3984], 50.00th=[ 4016], 60.00th=[ 4048],
     | 70.00th=[ 4256], 80.00th=[ 4256], 90.00th=[ 4320], 95.00th=[ 4448],
     | 99.00th=[ 7776], 99.50th=[ 9408], 99.90th=[12608], 99.95th=[14144],
     | 99.99th=[24960]
    bw (KB  /s): min=94664, max=132096, per=25.02%, avg=122618.12, stdev=4498.57
    lat (msec) : 2=0.01%, 4=49.30%, 10=50.33%, 20=0.36%, 50=0.02%
  cpu          : usr=0.08%, sys=8.07%, ctx=461770, majf=0, minf=4081
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=229691/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=114846MB, aggrb=489999KB/s, minb=489999KB/s, maxb=489999KB/s, mint=240004msec, maxt=240004msec

CPU idleness:
  system: 92.95%
  unit work: mean=52.35us, stddev=3.06