combined/BEEGFS-all-k8s-node/fio-k8s-read-unbuffered-block_64k-size_1G-threads_1.log
fio-beegfs-read-unbuffered-block_64k-size_1G-threads_1: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-read-unbuffered-block_64k-size_1G-threads_1: Laying out IO file(s) (4 file(s) / 4096MB)

fio-beegfs-read-unbuffered-block_64k-size_1G-threads_1: (groupid=0, jobs=1): err= 0: pid=750: Fri Nov 23 07:23:54 2018
  read : io=27865MB, bw=118890KB/s, iops=1857, runt=240001msec
    clat (usec): min=384, max=28046, avg=536.51, stdev=173.49
     lat (usec): min=384, max=28046, avg=536.63, stdev=173.49
    clat percentiles (usec):
     |  1.00th=[  426],  5.00th=[  450], 10.00th=[  462], 20.00th=[  482],
     | 30.00th=[  498], 40.00th=[  510], 50.00th=[  524], 60.00th=[  532],
     | 70.00th=[  548], 80.00th=[  564], 90.00th=[  588], 95.00th=[  612],
     | 99.00th=[  756], 99.50th=[ 1368], 99.90th=[ 3152], 99.95th=[ 3248],
     | 99.99th=[ 3472]
    bw (KB  /s): min=106112, max=138752, per=100.00%, avg=118954.81, stdev=5354.08
    lat (usec) : 500=31.64%, 750=67.36%, 1000=0.26%
    lat (msec) : 2=0.32%, 4=0.42%, 10=0.01%, 50=0.01%
  cpu          : usr=0.54%, sys=10.73%, ctx=665229, majf=0, minf=7906
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=445840/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=27865MB, aggrb=118890KB/s, minb=118890KB/s, maxb=118890KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 92.65%
  unit work: mean=52.04us, stddev=2.29