combined/BEEGFS-all-k8s-node/fio-k8s-write-buffered-block_1024k-size_4G-threads_1.log
fio-beegfs-write-buffered-block_1024k-size_4G-threads_1: (g=0): rw=rw, bs=1M-1M/1M-1M/1M-1M, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-write-buffered-block_1024k-size_4G-threads_1: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-write-buffered-block_1024k-size_4G-threads_1: (groupid=0, jobs=1): err= 0: pid=4453: Sun Nov 18 23:54:36 2018
  write: io=89299MB, bw=381007KB/s, iops=372, runt=240001msec
    clat (usec): min=862, max=771872, avg=2669.32, stdev=26647.32
     lat (usec): min=879, max=771889, avg=2685.53, stdev=26647.33
    clat percentiles (usec):
     |  1.00th=[  956],  5.00th=[ 1012], 10.00th=[ 1032], 20.00th=[ 1064],
     | 30.00th=[ 1080], 40.00th=[ 1096], 50.00th=[ 1112], 60.00th=[ 1128],
     | 70.00th=[ 1144], 80.00th=[ 1160], 90.00th=[ 1192], 95.00th=[ 1208],
     | 99.00th=[ 1304], 99.50th=[ 1416], 99.90th=[477184], 99.95th=[501760],
     | 99.99th=[692224]
    bw (KB  /s): min= 2039, max=944128, per=100.00%, avg=406767.46, stdev=383997.02
    lat (usec) : 1000=3.21%
    lat (msec) : 2=96.34%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.06%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.28%, 750=0.05%, 1000=0.01%
  cpu          : usr=0.81%, sys=11.43%, ctx=820866, majf=0, minf=1736
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=89299/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=89299MB, aggrb=381007KB/s, minb=381007KB/s, maxb=381007KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 99.33%
  unit work: mean=55.85us, stddev=2.37