combined/BEEGFS-all-k8s-node/fio-k8s-write-buffered-block_128k-size_2G-threads_2.log
fio-beegfs-write-buffered-block_128k-size_2G-threads_2: (g=0): rw=rw, bs=128K-128K/128K-128K/128K-128K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-buffered-block_128k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-write-buffered-block_128k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-write-buffered-block_128k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=6693: Mon Nov 19 02:33:46 2018
  write: io=124804MB, bw=532201KB/s, iops=4157, runt=240133msec
    clat (usec): min=8, max=680322, avg=478.18, stdev=11405.87
     lat (usec): min=9, max=680324, avg=479.86, stdev=11405.90
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[    9],
     | 30.00th=[   10], 40.00th=[   13], 50.00th=[   30], 60.00th=[   31],
     | 70.00th=[   32], 80.00th=[  612], 90.00th=[  676], 95.00th=[  708],
     | 99.00th=[  772], 99.50th=[  804], 99.90th=[ 3216], 99.95th=[415744],
     | 99.99th=[493568]
    bw (KB  /s): min=  252, max=753152, per=52.67%, avg=280308.04, stdev=286355.95
    lat (usec) : 10=22.59%, 20=20.12%, 50=31.55%, 100=0.74%, 250=0.01%
    lat (usec) : 500=0.04%, 750=23.20%, 1000=1.62%
    lat (msec) : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.06%, 750=0.01%
  cpu          : usr=0.66%, sys=16.36%, ctx=1103757, majf=0, minf=16437
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=998429/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=124804MB, aggrb=532200KB/s, minb=532200KB/s, maxb=532200KB/s, mint=240133msec, maxt=240133msec

CPU idleness:
  system: 93.06%
  unit work: mean=52.44us, stddev=4.40