combined/BEEGFS-all-k8s-node/fio-k8s-write-buffered-block_128k-size_4G-threads_1.log
fio-beegfs-write-buffered-block_128k-size_4G-threads_1: (g=0): rw=rw, bs=128K-128K/128K-128K/128K-128K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-write-buffered-block_128k-size_4G-threads_1: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-write-buffered-block_128k-size_4G-threads_1: (groupid=0, jobs=1): err= 0: pid=3899: Sun Nov 18 23:05:59 2018
  write: io=86548MB, bw=369269KB/s, iops=2884, runt=240001msec
    clat (usec): min=9, max=744448, avg=344.19, stdev=9387.94
     lat (usec): min=10, max=744450, avg=345.58, stdev=9387.95
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[    9], 10.00th=[    9], 20.00th=[   10],
     | 30.00th=[   10], 40.00th=[   10], 50.00th=[   10], 60.00th=[   10],
     | 70.00th=[   12], 80.00th=[  540], 90.00th=[  572], 95.00th=[  596],
     | 99.00th=[  636], 99.50th=[  652], 99.90th=[  724], 99.95th=[21120],
     | 99.99th=[485376]
    bw (KB  /s): min= 4071, max=872448, per=100.00%, avg=390210.05, stdev=356663.34
    lat (usec) : 10=11.72%, 20=63.21%, 50=0.07%, 100=0.01%, 250=0.01%
    lat (usec) : 500=1.97%, 750=22.95%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.04%, 750=0.01%
  cpu          : usr=0.94%, sys=14.29%, ctx=783677, majf=0, minf=13409
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=692383/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=86548MB, aggrb=369269KB/s, minb=369269KB/s, maxb=369269KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 94.69%
  unit work: mean=53.25us, stddev=3.47