combined/BEEGFS-all-k8s-node/fio-k8s-write-buffered-block_16k-size_4G-threads_8.log
fio-beegfs-write-buffered-block_16k-size_4G-threads_8: (g=0): rw=rw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 8 processes
fio-beegfs-write-buffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-buffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-write-buffered-block_16k-size_4G-threads_8: (groupid=0, jobs=8): err= 0: pid=16110: Tue Nov 20 05:08:26 2018
  write: io=111062MB, bw=473048KB/s, iops=29565, runt=240414msec
    clat (usec): min=1, max=572031, avg=269.58, stdev=8718.69
     lat (usec): min=1, max=572031, avg=269.82, stdev=8718.69
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    5], 95.00th=[   13],
     | 99.00th=[ 1208], 99.50th=[ 1448], 99.90th=[30848], 99.95th=[40192],
     | 99.99th=[477184]
    bw (KB  /s): min=   31, max=397280, per=13.00%, avg=61514.41, stdev=67727.51
    lat (usec) : 2=3.93%, 4=59.03%, 10=31.61%, 20=1.46%, 50=0.79%
    lat (usec) : 100=0.04%, 250=0.01%, 500=0.01%, 750=0.69%, 1000=0.57%
    lat (msec) : 2=1.54%, 4=0.01%, 10=0.01%, 20=0.05%, 50=0.22%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.03%, 750=0.01%
  cpu          : usr=0.47%, sys=3.98%, ctx=1956527, majf=0, minf=125637
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=7107957/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=111062MB, aggrb=473047KB/s, minb=473047KB/s, maxb=473047KB/s, mint=240414msec, maxt=240414msec

CPU idleness:
  system: 96.24%
  unit work: mean=54.29us, stddev=2.19